/** ЗАДАЧА 22 - Остаток от деления
 *
 * 1. Выведите в консоль остаток от деления "myNumber1" на "myNumber2".
 *
 * 2. Какой приоритет и ассоциативность
 * имеет оператор остаток от деления?
 *
 * 3. Проверьте ассоциативность самостоятельно
 */

const myNumber1 = 10 // 10 = 3 + 3 + 3 + 1
const myNumber2 = 3

console.log(myNumber1 % myNumber2)

console.log(3 * 7 % 4)
console.log(15 + 25 % 4)

//Приоритет оператора % выше операторов + и -, такой же, как * и / 
//При наличии нескольких операторов одного приоритета в выражении, они вполняются слева направо

